## Terraform Output
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`
<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_firewall.mc_fw will be created
  + resource "hcloud_firewall" "mc_fw" {
      + id     = (known after apply)
      + labels = (known after apply)
      + name   = "mc-fw"

      + apply_to {
          + label_selector = "role=minecraft"
          + server         = (known after apply)
        }

      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
            # (1 unchanged attribute hidden)
        }
      + rule {
          + destination_ips = []
          + direction       = "in"
          + port            = "25565"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
            # (1 unchanged attribute hidden)
        }
    }

  # hcloud_server.mc will be created
  + resource "hcloud_server" "mc" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "debian-13"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "role" = "minecraft"
        }
      + location                   = "ash"
      + name                       = "aitai-mc-server"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cpx21"
      + shutdown_before_deletion   = false
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
    }

  # hcloud_ssh_key.mc_ci_key will be created
  + resource "hcloud_ssh_key" "mc_ci_key" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + labels      = {}
      + name        = "mc-ci-key"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINZ/plkEfLr2Sqgal2KW3mhzTVwa+paBSL5I4DWLOD0P ci@aitai-mc"
    }

  # hcloud_volume.mc_vol will be created
  + resource "hcloud_volume" "mc_vol" {
      + delete_protection = false
      + format            = "ext4"
      + id                = (known after apply)
      + linux_device      = (known after apply)
      + location          = (known after apply)
      + name              = "mc-vol"
      + server_id         = (known after apply)
      + size              = 50
    }

  # hcloud_volume_attachment.mc_vol_attach will be created
  + resource "hcloud_volume_attachment" "mc_vol_attach" {
      + automount = false
      + id        = (known after apply)
      + server_id = (known after apply)
      + volume_id = (known after apply)
    }

  # null_resource.mc_provisioner will be created
  + resource "null_resource" "mc_provisioner" {
      + id = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + server_ip = (known after apply)
  + volume_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dotunwrap | Action: `pull_request`